## SQL Queries

To be able to execute SQL queries from within a Jupyter notebook, we will use the `sql_magic` extension (https://github.com/pivotal/sql_magic)

    sudo pip3 install -U sql_magic

In [5]:
pip install -U sql_magic

Collecting sql_magic
  Downloading https://files.pythonhosted.org/packages/a6/a7/ccdc67278de3f34db5d484f9b6c59ad9a536beda4a5acad5ecb3b0932246/sql_magic-0.0.4-py3-none-any.whl
Requirement already satisfied, skipping upgrade: traitlets in /usr/local/lib/python3.7/dist-packages (from sql_magic) (5.0.5)
Collecting findspark
  Downloading https://files.pythonhosted.org/packages/fc/2d/2e39f9a023479ea798eed4351cd66f163ce61e00c717e03c37109f00c0f2/findspark-1.4.2-py2.py3-none-any.whl
Requirement already satisfied, skipping upgrade: pandas in /usr/local/lib/python3.7/dist-packages (from sql_magic) (1.1.5)
Requirement already satisfied, skipping upgrade: sqlparse in /usr/local/lib/python3.7/dist-packages (from sql_magic) (0.4.1)
Requirement already satisfied, skipping upgrade: ipython in /usr/local/lib/python3.7/dist-packages (from sql_magic) (5.5.0)
Requirement already satisfied, skipping upgrade: jupyter in /usr/local/lib/python3.7/dist-packages (from sql_magic) (1.0.0)
Requirement already satisfied, skipping upgrade: ipython-genutils in /usr/local/lib/python3.7/dist-packages (from traitlets->sql_magic) (0.2.0)
Requirement already satisfied, skipping upgrade: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas->sql_magic) (2.8.1)
Requirement already satisfied, skipping upgrade: numpy>=1.15.4 in /usr/local/lib/python3.7/dist-packages (from pandas->sql_magic) (1.19.5)
Requirement already satisfied, skipping upgrade: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas->sql_magic) (2018.9)
Requirement already satisfied, skipping upgrade: prompt-toolkit<2.0.0,>=1.0.4 in /usr/local/lib/python3.7/dist-packages (from ipython->sql_magic) (1.0.18)
Requirement already satisfied, skipping upgrade: pickleshare in /usr/local/lib/python3.7/dist-packages (from ipython->sql_magic) (0.7.5)
Requirement already satisfied, skipping upgrade: decorator in /usr/local/lib/python3.7/dist-packages (from ipython->sql_magic) (4.4.2)
Requirement already satisfied, skipping upgrade: simplegeneric>0.8 in /usr/local/lib/python3.7/dist-packages (from ipython->sql_magic) (0.8.1)
Requirement already satisfied, skipping upgrade: setuptools>=18.5 in /usr/local/lib/python3.7/dist-packages (from ipython->sql_magic) (53.0.0)
Requirement already satisfied, skipping upgrade: pygments in /usr/local/lib/python3.7/dist-packages (from ipython->sql_magic) (2.6.1)
Requirement already satisfied, skipping upgrade: pexpect; sys_platform != "win32" in /usr/local/lib/python3.7/dist-packages (from ipython->sql_magic) (4.8.0)
Requirement already satisfied, skipping upgrade: jupyter-console in /usr/local/lib/python3.7/dist-packages (from jupyter->sql_magic) (5.2.0)
Requirement already satisfied, skipping upgrade: ipywidgets in /usr/local/lib/python3.7/dist-packages (from jupyter->sql_magic) (7.6.3)
Requirement already satisfied, skipping upgrade: qtconsole in /usr/local/lib/python3.7/dist-packages (from jupyter->sql_magic) (5.0.2)
Requirement already satisfied, skipping upgrade: ipykernel in /usr/local/lib/python3.7/dist-packages (from jupyter->sql_magic) (4.10.1)
Requirement already satisfied, skipping upgrade: notebook in /usr/local/lib/python3.7/dist-packages (from jupyter->sql_magic) (5.3.1)
Requirement already satisfied, skipping upgrade: nbconvert in /usr/local/lib/python3.7/dist-packages (from jupyter->sql_magic) (5.6.1)
Requirement already satisfied, skipping upgrade: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas->sql_magic) (1.15.0)
Requirement already satisfied, skipping upgrade: wcwidth in /usr/local/lib/python3.7/dist-packages (from prompt-toolkit<2.0.0,>=1.0.4->ipython->sql_magic) (0.2.5)
Requirement already satisfied, skipping upgrade: ptyprocess>=0.5 in /usr/local/lib/python3.7/dist-packages (from pexpect; sys_platform != "win32"->ipython->sql_magic) (0.7.0)
Requirement already satisfied, skipping upgrade: jupyter-client in /usr/local/lib/python3.7/dist-packages (from jupyter-console->jupyter->sql_magic) (5.3.5)
Requirement already satisfied, skipping upgrade: nbformat>=4.2.0 in /usr/local/lib/python3.7/dist-packages (from ipywidgets->jupyter->sql_magic) (5.1.2)
Requirement already satisfied, skipping upgrade: jupyterlab-widgets>=1.0.0; python_version >= "3.6" in /usr/local/lib/python3.7/dist-packages (from ipywidgets->jupyter->sql_magic) (1.0.0)
Requirement already satisfied, skipping upgrade: widgetsnbextension~=3.5.0 in /usr/local/lib/python3.7/dist-packages (from ipywidgets->jupyter->sql_magic) (3.5.1)
Requirement already satisfied, skipping upgrade: qtpy in /usr/local/lib/python3.7/dist-packages (from qtconsole->jupyter->sql_magic) (1.9.0)
Requirement already satisfied, skipping upgrade: pyzmq>=17.1 in /usr/local/lib/python3.7/dist-packages (from qtconsole->jupyter->sql_magic) (22.0.3)
Requirement already satisfied, skipping upgrade: jupyter-core in /usr/local/lib/python3.7/dist-packages (from qtconsole->jupyter->sql_magic) (4.7.1)
Requirement already satisfied, skipping upgrade: tornado>=4.0 in /usr/local/lib/python3.7/dist-packages (from ipykernel->jupyter->sql_magic) (5.1.1)
Requirement already satisfied, skipping upgrade: Send2Trash in /usr/local/lib/python3.7/dist-packages (from notebook->jupyter->sql_magic) (1.5.0)
Requirement already satisfied, skipping upgrade: terminado>=0.8.1 in /usr/local/lib/python3.7/dist-packages (from notebook->jupyter->sql_magic) (0.9.2)
Requirement already satisfied, skipping upgrade: jinja2 in /usr/local/lib/python3.7/dist-packages (from notebook->jupyter->sql_magic) (2.11.3)
Requirement already satisfied, skipping upgrade: mistune<2,>=0.8.1 in /usr/local/lib/python3.7/dist-packages (from nbconvert->jupyter->sql_magic) (0.8.4)
Requirement already satisfied, skipping upgrade: pandocfilters>=1.4.1 in /usr/local/lib/python3.7/dist-packages (from nbconvert->jupyter->sql_magic) (1.4.3)
Requirement already satisfied, skipping upgrade: bleach in /usr/local/lib/python3.7/dist-packages (from nbconvert->jupyter->sql_magic) (3.3.0)
Requirement already satisfied, skipping upgrade: entrypoints>=0.2.2 in /usr/local/lib/python3.7/dist-packages (from nbconvert->jupyter->sql_magic) (0.3)
Requirement already satisfied, skipping upgrade: testpath in /usr/local/lib/python3.7/dist-packages (from nbconvert->jupyter->sql_magic) (0.4.4)
Requirement already satisfied, skipping upgrade: defusedxml in /usr/local/lib/python3.7/dist-packages (from nbconvert->jupyter->sql_magic) (0.6.0)
Requirement already satisfied, skipping upgrade: jsonschema!=2.5.0,>=2.4 in /usr/local/lib/python3.7/dist-packages (from nbformat>=4.2.0->ipywidgets->jupyter->sql_magic) (2.6.0)
Requirement already satisfied, skipping upgrade: MarkupSafe>=0.23 in /usr/local/lib/python3.7/dist-packages (from jinja2->notebook->jupyter->sql_magic) (1.1.1)
Requirement already satisfied, skipping upgrade: packaging in /usr/local/lib/python3.7/dist-packages (from bleach->nbconvert->jupyter->sql_magic) (20.9)
Requirement already satisfied, skipping upgrade: webencodings in /usr/local/lib/python3.7/dist-packages (from bleach->nbconvert->jupyter->sql_magic) (0.5.1)
Requirement already satisfied, skipping upgrade: pyparsing>=2.0.2 in /usr/local/lib/python3.7/dist-packages (from packaging->bleach->nbconvert->jupyter->sql_magic) (2.4.7)
Installing collected packages: findspark, sql-magic
Successfully installed findspark-1.4.2 sql-magic-0.0.4

In [6]:
pip install mysqlclient

Requirement already satisfied: mysqlclient in /usr/local/lib/python3.7/dist-packages (2.0.3)

In [7]:
from sqlalchemy import create_engine

In [8]:
conn_string = 'mysql://{user}:{password}@{host}/?charset=utf8'.format(
    host = 'db.ipeirotis.org', 
    user = 'student',
    password = 'dwdstudent2015',
    encoding = 'utf-8')
engine = create_engine(conn_string)

In [9]:
%reload_ext sql_magic

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [10]:
%config SQL.conn_name = 'engine'

In [11]:
%%read_sql
show databases

Query started at 11:56:18 PM UTC; Query executed in 0.03 m

             Database
0  information_schema
1        bike_sharing
2            citibike
3   citibike_fall2017
4            facebook
5                imdb
6               music
7     nypd_complaints
8              public
9         restaurants

In [12]:
%%read_sql
use imdb

Query started at 11:56:26 PM UTC; Query executed in 0.01 m

In [13]:
%%read_sql
show tables

Query started at 11:56:29 PM UTC; Query executed in 0.01 m

     Tables_in_imdb
0            actors
1         directors
2  directors_genres
3            movies
4  movies_directors
5     movies_genres
6             roles

In [14]:
%%read_sql
describe actors

Query started at 11:56:32 PM UTC; Query executed in 0.01 m

        Field          Type Null  Key Default Extra
0          id       int(11)   NO  PRI       0
1  first_name  varchar(100)  YES  MUL    None
2   last_name  varchar(100)  YES  MUL    None
3      gender       char(1)  YES         None

In [15]:
%%read_sql
describe roles

Query started at 11:56:34 PM UTC; Query executed in 0.01 m

      Field          Type Null  Key Default Extra
0  actor_id       int(11)  YES  MUL    None
1  movie_id       int(11)  YES  MUL    None
2      role  varchar(100)  YES  MUL    None

### SELECT Queries (IMDB database)

In [16]:
%%read_sql
USE imdb

Query started at 11:56:41 PM UTC; Query executed in 0.01 m

#### Find all movie titles with id less than 100.

In [17]:
%%read_sql
SELECT * 
FROM movies 
WHERE id<100

Query started at 11:56:47 PM UTC; Query executed in 0.01 m

    id                                               name  year  rank
0    0                                                #28  2002   NaN
1    1                #7 Train: An Immigrant Journey, The  2000   NaN
2    2                                                  $  1971   6.4
3    3                                      $1,000 Reward  1913   NaN
4    4                                      $1,000 Reward  1915   NaN
..  ..                                                ...   ...   ...
91  95                            'Cross the Mexican Line  1914   NaN
92  96                 'Den vide verden's billedbog nr. 1  1938   NaN
93  97  'Deutschland' Leaving New York at Full Speed (...  1902   NaN
94  98                             'Diamond S' Ranch, The  1912   NaN
95  99             'Dikke Bertha' op doortocht in Brussel  1919   NaN

[96 rows x 4 columns]

#### Find all information about movies that were released before 1895 (excl)

In [18]:
%%read_sql
SELECT *
FROM movies 
WHERE year<1895

Query started at 11:56:51 PM UTC; Query executed in 0.01 m

        id                        name  year  rank
0    13261      Amateur Gymnast, No. 2  1894   NaN
1    17623   Annabelle Butterfly Dance  1894   5.3
2    17627  Annabelle Serpentine Dance  1894   6.1
3    17628         Annabelle Sun Dance  1894   NaN
4    17770                Annie Oakley  1894   4.9
..     ...                         ...   ...   ...
76  363640      Whirlwind Gun Spinning  1894   NaN
77  364791                 Widder, The  1894   NaN
78  368839                   Wrestling  1892   2.0
79  368852          Wrestling Dog, The  1894   NaN
80  368854             Wrestling Match  1894   NaN

[81 rows x 4 columns]

#### Find all information about movies that were released before 1895 and after 2006 (inclusive)

In [ ]:
%%read_sql
SELECT *
FROM movies 
WHERE year<=1895 OR year>=2006

#### Find all information about movies released between 1895 and 1898 (excl)

In [ ]:
%%read_sql
SELECT *
FROM movies 
WHERE year>1895 AND year<1898

#### Find all information about *actresses* who are have first name Skyler

In [ ]:
%%read_sql
SELECT *
FROM actors
WHERE first_name = 'Skyler' AND gender = 'F';

In [ ]:
%%read_sql
select director_id,count(*) as number_of_movies from movies_directors group by director_id having number_of_movies >100;

#### Find the director ID of Steven Spielberg

In [ ]:
%%read_sql
SELECT id
FROM directors
WHERE first_name = 'Steven' AND last_name = 'Spielberg';

#### Find the director IDs and the first and last names of directors with the last name Spielberg and Hitchcock

In [ ]:
%%read_sql
SELECT id, first_name, last_name
FROM directors
WHERE last_name = 'Spielberg' OR last_name = 'Hitchcock';

#### Find all genres of films and the corresponding probabilities for the director ID that corresponds to Steven Spielberg. Sort the results by probability.

In [ ]:
%%read_sql
SELECT genre, prob
FROM directors_genres
WHERE director_id = '75380' # the id of Spielberg FROM above
ORDER BY prob DESC

#### Find the id of the movie Schindler's List.

In [ ]:
%%read_sql
SELECT *
FROM movies
WHERE name = "Schindler's List"

#### List all the roles for the movie with id 290070. Sort them alphabetically

In [ ]:
%%read_sql
SELECT *
FROM roles
WHERE movie_id = '290070'

### SELECT Queries (Facebook database)

In [ ]:
%%read_sql
USE facebook

#### Find all names of students FROM the Profiles table

In [ ]:
%%read_sql
SELECT name
FROM Profiles

#### Get the names and sex of all liberal students

In [ ]:
%%read_sql
SELECT name, sex
FROM Profiles
WHERE PoliticalViews ='Liberal'

#### Get the High Schools of the students in the database

In [ ]:
%%read_sql
SELECT HighSchool
FROM Profiles

#### Find all the possible political views, eliminating duplicate entries

In [ ]:
%%read_sql
SELECT DISTINCT PoliticalViews
FROM Profiles

#### Find all possible relationship statuses

In [ ]:
%%read_sql
SELECT DISTINCT Status
FROM Relationship

#### Find all possible values for the “status” attribute in Profiles

In [ ]:
%%read_sql
SELECT DISTINCT Status
FROM Profiles

#### Find all possible values for the “Residence” attribute in Profiles, eliminating duplicates

In [ ]:
%%read_sql
SELECT DISTINCT Residence
FROM Profiles

#### Find all students living in Palladium

In [ ]:
%%read_sql
SELECT Name, Residence
FROM Profiles
WHERE Residence LIKE 'Palladium%%'

#### Find all students who attended Stuyvesant

In [ ]:
%%read_sql
SELECT *
FROM Profiles
WHERE HighSchool LIKE 'Stuyvesant%%'

#### Find all names that contain a digit

In [ ]:
%%read_sql
SELECT * 
FROM Profiles 
WHERE name REGEXP '[0-9]+'

#### Find all students with a name that contains a non-letter character, other than \- and \.

In [ ]:
%%read_sql
SELECT * 
FROM Profiles 
WHERE name NOT REGEXP '^[A-z \-\.]+$'

### Aggregation Queries (IMDB Database)

In [ ]:
%%read_sql
USE imdb;

#### Number of movies for each director

In [ ]:
%%read_sql
SELECT director_id, count(*) AS NumberOfMovies
FROM movies_directors 
GROUP BY director_id
LIMIT 100;

#### Rank directors by the number of movies they directed

In [ ]:
%%read_sql
SELECT director_id, count(*) AS NumberOfMovies
FROM movies_directors 
GROUP BY director_id
ORDER BY count(*) desc

#### Find the number of actors in each movie

In [ ]:
%%read_sql
SELECT movie_id, count(*) 
FROM roles 
GROUP BY movie_id

#### Find the movies with more than 100 actors

In [ ]:
%%read_sql
SELECT movie_id, count(*) 
FROM roles 
GROUP BY movie_id
HAVING count(*) > 100;

#### Find the most popular genres (basd on the number of movies)

In [ ]:
%%read_sql
SELECT genre, count(*) 
FROM movies_genres
GROUP BY genre
ORDER BY count(*) desc

#### Find the average rank of the movies in the database, per year of release

In [ ]:
%%read_sql
SELECT year, avg(rank) 
FROM movies
GROUP BY year

### Aggregation Queries (Facebook database)

In [ ]:
%%read_sql
USE facebook

#### List the number of males and females

In [ ]:
%%read_sql
SELECT sex, count(*) 
FROM Profiles 
GROUP BY sex

#### List the number of students for each political view

In [ ]:
%%read_sql
SELECT PoliticalViews, count(*) 
FROM Profiles 
GROUP BY PoliticalViews

#### List the number of males and female students for each political view

In [ ]:
%%read_sql
SELECT Sex, PoliticalViews, count(*) 
FROM Profiles 
WHERE Sex is not null and PoliticalViews is not null
GROUP BY Sex, PoliticalViews

#### List the number of students per each birth year: Use the Year(date) function to get the year value FROM a dateime column List only years that have at least 10 students

In [ ]:
%%read_sql
SELECT YEAR(birthday), count(*) 
FROM Profiles 
WHERE birthday is not null
GROUP BY YEAR(birthday)
HAVING count(*) > 10

#### Find the most popular tv shows and books

In [ ]:
%%read_sql
SELECT TVShow, count(*) 
FROM FavoriteTVShows 
WHERE TVShow is not null 
GROUP BY TVShow
ORDER BY count(*) desc

In [ ]:
%%read_sql
SELECT Book, count(*) 
FROM FavoriteBooks
WHERE Book is not null 
GROUP BY Book
ORDER BY count(*) desc

#### Find the number of students in various relationship statuses

In [ ]:
%%read_sql
SELECT Status, count(*) 
FROM Relationship
GROUP BY Status

#### Find the most popular majors (concentrations)

In [ ]:
%%read_sql
SELECT Concentration,count(*) FROM Concentration
WHERE Concentration is not null
GROUP BY Concentration
ORDER BY count(*) desc;

### JOINS

In [ ]:
%%read_sql
USE imdb

In [ ]:
%%read_sql
# List all the movies from year 2000
SELECT *
FROM movies M
WHERE M.year = 2000;

#### List all the movies from year 2000 and their genres

In [ ]:
%%read_sql
SELECT *
FROM movies M INNER JOIN movies_genres MG ON M.id=MG.movie_id
WHERE M.year = 2000;

#### List all the Drama movies from year 2000

In [ ]:
%%read_sql

SELECT *
FROM movies M INNER JOIN movies_genres MG ON M.id=MG.movie_id
WHERE M.year = 2000 AND MG.genre = 'Drama';

#### List all the movies from year 2000 and their average rating broken down by genre

In [ ]:
%%read_sql
SELECT AVG(M.rank), MG.genre
FROM movies M INNER JOIN movies_genres MG ON M.id=MG.movie_id
WHERE M.year = 2000
GROUP BY MG.genre;

In [ ]:
%%read_sql
# List the average ratings for the movies broken down by genre
SELECT AVG(M.rank) AS avg_rating, MG.genre
FROM movies M INNER JOIN movies_genres MG ON M.id=MG.movie_id
GROUP BY MG.genre
ORDER BY avg_rating DESC

In [ ]:
%%read_sql
SELECT distinct a.first_name, a.last_name 
FROM actors a INNER JOIN roles r ON a.id = r.actor_id
    INNER JOIN movies_directors md ON r.movie_id = md.movie_id
    INNER JOIN directors d ON d.id = md.director_id
WHERE d.first_name = 'Steven' and d.last_name='Spielberg';

#### List all the actors that worked with Steven Spielberg

#### Compute the average rank for the movies direcred by steven spielberg

In [ ]:
%%read_sql
SELECT avg(rank) 
FROM movies m 
    INNER JOIN movies_directors md ON m.id = md.movie_id
    INNER JOIN directors d ON d.id = md.director_id
WHERE d.first_name = 'Steven' and d.last_name='Spielberg';

#### List the movies of Brad Pitt - exclude those that he plays himself

In [ ]:
%%read_sql
SELECT m.name 
FROM movies m 
    INNER JOIN roles r on m.id = r.movie_id 
    INNER JOIN actors a on r.actor_id = a.id
WHERE r.role not like '%%Himself%%' and a.first_name = 'Brad' and a.last_name = 'Pitt'

#### Average rank of Brad Pitt's movies

In [ ]:
%%read_sql
SELECT avg(rank) 
FROM movies m 
    INNER JOIN roles r on m.id = r.movie_id 
    INNER JOIN actors a on r.actor_id = a.id
WHERE r.role not like '%%Himself%%' and a.first_name = 'Brad' and a.last_name = 'Pitt'

#### List the genre of the movies where Sean Connery appears, and rank them in descending order by count

In [ ]:
%%read_sql
SELECT mg.genre, count(*) 
FROM movies_genres mg 
    INNER JOIN movies m ON m.id =mg.movie_id
    INNER JOIN roles r ON m.id = r.movie_id 
    INNER JOIN actors a ON r.actor_id = a.id
WHERE r.role not like '%%Himself%%' and a.first_name = 'Sean' and a.last_name = 'Connery'
GROUP BY genre
ORDER BY count(*) desc

#### Compute the average rank for the movies of each actor and rank the actors in descending order based on that rank. List only actors with at least 20 rated movies.

In [ ]:
%%read_sql
SELECT a.*, avg(rank) as avg_rating, count(m.id) as num_movies, count(m.rank) as rated_movies
FROM movies m 
    INNER JOIN roles r on m.id = r.movie_id 
    INNER JOIN actors a ON a.id = r.actor_id
GROUP BY a.id
HAVING count(m.rank)>=20
ORDER BY avg(rank) desc

### Subqueries

#### List all the actors that have not worked with Francis Ford Coppola.

In [ ]:
%%read_sql 
SELECT * 
FROM actors 
WHERE id NOT IN (
    SELECT DISTINCT R.actor_id
    FROM roles R 
        INNER JOIN movies_directors MD ON R.movie_id=MD.movie_id
        INNER JOIN directors D ON MD.director_id=D.id 
    WHERE D.first_name = 'Francis Ford' and D.last_name = 'Coppola'
)

#### Find the average number of movies directed by each director

In [ ]:
%%read_sql
SELECT avg(noMovies)
FROM 
    (
    SELECT director_id, count(*) as noMovies 
    FROM movies_directors dm 
    GROUP BY director_id
    ) r;

#### Report how many directors have directed one movie, two movies, three movies, etc. (in other words, create a the distribution for the variable "number of movies directed by a given director")

In [ ]:
%%read_sql
SELECT NumMovies, COUNT(director_id) as NumDirectors
FROM 
    (
    SELECT director_id, count(*) as NumMovies 
    FROM movies_directors dm 
    GROUP BY director_id
    ) r
GROUP BY NumMovies
ORDER BY NumMovies;

#### Find the average number of movies played by each actor

In [ ]:
%%read_sql
SELECT avg(noMovies) 
FROM
(
SELECT actor_id, count(distinct movie_id) as noMovies 
FROM roles 
GROUP BY actor_id
) r;

In [ ]:
%%read_sql
SELECT NumMovies, COUNT(actor_id) as NumActors
FROM 
    (
    SELECT actor_id, count(*) as NumMovies 
    FROM roles r 
    GROUP BY actor_id
    ) r
GROUP BY NumMovies
ORDER BY NumMovies;

#### Find the maximum number of genres associated with a movie

In [ ]:
%%read_sql
SELECT max(noGenres) FROM (
SELECT count(*) as noGenres
FROM movies_genres
GROUP BY movie_id) r;

In [ ]:
%%read_sql
SELECT max(noMovies)FROM (
SELECT count(*) as noMovies, director_id as director
FROM movies_directors
GROUP BY director_id
) r;

In [ ]:
%%read_sql
SELECT count(*) as noMovies, director_id as director
FROM movies_directors
GROUP BY director_id
;

#### Compare the favorite books of liberal and conservative students

In [ ]:
%%read_sql

USE facebook;

SELECT BC.Book, 
    BC.C AS cons,
    BL.L AS libs,
    BC.C/C.NC AS perc_cons, 
    BL.L/L.NL AS perc_libs,
    (BC.C/C.NC)/(BL.L/L.NL) AS lift_cons,
    (BL.L/L.NL)/(BC.C/C.NC) AS lift_libs
FROM 
    (
    SELECT B.Book, COUNT(P.ProfileID) AS C
    FROM Profiles AS P 
        INNER JOIN FavoriteBooks AS B ON P.ProfileID = B.ProfileId
    WHERE PoliticalViews = 'Conservative'
    GROUP BY B.Book
    ) BC 
JOIN 
    (
    SELECT B.Book, COUNT(P.ProfileID) AS L
    FROM Profiles AS P 
        INNER JOIN FavoriteBooks AS B ON P.ProfileID = B.ProfileId
    WHERE PoliticalViews = 'Liberal'
    GROUP BY B.Book
    ) BL ON BC.Book = BL.Book 
JOIN
    (
    SELECT COUNT(*) AS NC 
    FROM Profiles 
    WHERE PoliticalViews = 'Conservative'
    ) C 
JOIN 
    (
    SELECT COUNT(*) AS NL
    FROM Profiles 
    WHERE PoliticalViews = 'Liberal'
    ) L
WHERE BC.C > 5 AND BL.L > 5
ORDER BY lift_cons DESC